const schedule = {
    "mon": {
        "date": "2025-09-22",
        "lessons": [
            {
                "start": "8:30",
                "end": "9:15",
                "subject": "Географія",
                "teacher": "Ступка М. І.",
                "location": "Ауд 3-2",
                "type": "Лекция"
            },
            {
                "start": "9:25",
                "end": "10:10",
                "subject": "Географія",
                "teacher": "Ступка М. І.",
                "location": "Ауд 3-2",
                "type": "Лекция"
            },
            {
                "start": "10:20",
                "end": "11:05",
                "subject": "Фізична культура",
                "teacher": "Смірнов А. А.",
                "location": "С/М_1",
                "type": "Лекция"
            },
            {
                "start": "11:25",
                "end": "12:10",
                "subject": "Фізична культура",
                "teacher": "Смірнов А. А.",
                "location": "С/М_1",
                "type": "Лекция"
            },
            {
                "start": "12:40",
                "end": "13:25",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "13:35",
                "end": "14:20",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "14:30",
                "end": "15:15",
                "subject": "Інформатика",
                "teacher": "Новікова Т. М.",
                "location": "Ауд 34",
                "type": "Лекция"
            },
            {
                "start": "15:25",
                "end": "16:10",
                "subject": "Інформатика",
                "teacher": "Новікова Т. М.",
                "location": "Ауд 34",
                "type": "Лекция"
            }
        ]
    },
    "tue": {
        "date": "2025-09-23",
        "lessons": [
            {
                "start": "8:30",
                "end": "9:15",
                "subject": "Історія",
                "teacher": "Бажан-Пушкіна Ю. П.",
                "location": "Ауд 25-2",
                "type": "Лекция"
            },
            {
                "start": "9:25",
                "end": "10:10",
                "subject": "Історія",
                "teacher": "Бажан-Пушкіна Ю. П.",
                "location": "Ауд 25-2",
                "type": "Лекция"
            },
            {
                "start": "10:20",
                "end": "11:05",
                "subject": "Біологія і екологія",
                "teacher": "Гінтов М. С.",
                "location": "Ауд 8-2",
                "type": "Лекция"
            },
            {
                "start": "11:25",
                "end": "12:10",
                "subject": "Біологія і екологія",
                "teacher": "Гінтов М. С.",
                "location": "Ауд 8-2",
                "type": "Лекция"
            },
            {
                "start": "12:40",
                "end": "13:25",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "13:35",
                "end": "14:20",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "14:30",
                "end": "15:15",
                "subject": "Фізична культура",
                "teacher": "Смірнов А. А.",
                "location": "С/М_1",
                "type": "Лекция"
            }
        ]
    },
    "wed": {
        "date": "2025-09-24",
        "lessons": [
            {
                "start": "8:30",
                "end": "9:15",
                "subject": "Фізика і астрономія",
                "teacher": "Журав В. В.",
                "location": "Ауд 45-2",
                "type": "Лекция"
            },
            {
                "start": "9:25",
                "end": "10:10",
                "subject": "Математика",
                "teacher": "Чіркова Н. В.",
                "location": "Ауд 32-2",
                "type": "Лекция"
            },
            {
                "start": "10:20",
                "end": "11:05",
                "subject": "Зарубіжна література",
                "teacher": "Іванченко С. С.",
                "location": "Ауд 23-2",
                "type": "Лекция"
            },
            {
                "start": "11:25",
                "end": "12:10",
                "subject": "Зарубіжна література",
                "teacher": "Іванченко С. С.",
                "location": "Ауд 23-2",
                "type": "Лекция"
            },
            {
                "start": "12:40",
                "end": "13:25",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "13:35",
                "end": "14:20",
                "subject": "Спецтехнологія",
                "teacher": "Ромашина В. В.",
                "location": "Ауд 23",
                "type": "Лекция"
            },
            {
                "start": "14:30",
                "end": "15:15",
                "subject": "Українська мова",
                "teacher": "Чорнобай Т. О.",
                "location": "Ауд 6-2",
                "type": "Лекция"
            },
            {
                "start": "15:25",
                "end": "16:10",
                "subject": "Українська мова",
                "teacher": "Чорнобай Т. О.",
                "location": "Ауд 6-2",
                "type": "Лекция"
            }
        ]
    },
    "thu": {
        "date": "2025-09-25",
        "lessons": [
            {
                "start": "8:00",
                "end": "13:35",
                "subject": "Виробниче навчання",
                "teacher": "Ковальчук М. В. / Мацак І. В.",
                "location": "ел.майс 1  / ел.майс 2",
                "timeBlocks": [
                    "8:00 - 8:45",
                    "8:55 - 9:40",
                    "9:50 - 10:35",
                    "11:00 - 11:45",
                    "11:55 - 12:40",
                    "12:50 - 13:35"
                ]
            }
        ]
    },
    "fri": {
        "date": "2025-09-26",
        "lessons": [
            {
                "start": "8:00",
                "end": "13:35",
                "subject": "Виробниче навчання",
                "teacher": "Ковальчук М. В. / Мацак І. В.",
                "location": "ел.майс 1  / ел.майс 2",
                "timeBlocks": [
                    "8:00 - 8:45",
                    "8:55 - 9:40",
                    "9:50 - 10:35",
                    "11:00 - 11:45",
                    "11:55 - 12:40",
                    "12:50 - 13:35"
                ]
            }
        ]
    }
};
